{
  "modified": "2025-07-06T19:10:47Z",
  "published": "2025-07-06T19:10:47Z",
  "schema_version": "1.5.0",
  "id": "GHSA-2r7g-8hpc-rpq9",
  "details": "From time to time we discover situations where the Redis application will allow a logged-in user to cause a denial-of-service or otherwise impact the performance or availability of the database they have access to, which can happen without explicitly violating the Redis Security Model. In some cases, such as CVE-2024-31227 and CVE-2024-31228, we elect to fix these denial-of-service possibilities in code as they result from error conditions. These decisions make tradeoffs between potential risks on the one hand, and the potential for introducing breaking changes, impacting database performance, and other considerations on the other.\r\n\r\nRecently, security researcher Gabriele Digregorio brought a similar potential denial-of-service issue to our attention. Based on Gabriele Digregorio’s research, and validated through our own analysis, this issue relies on abuse or misuse of the commands network protocol built into Redis and requires the user to be successfully authenticated. As such, it does not violate the Redis Security Model (therefore, we do not consider it a vulnerability and do not assign a CVE ID), but could still be used to cause unintended or unexpected impact to availability. Our assessment is that implementing an application change to prevent this possibility would negatively impact legitimate functionality and performance of Redis. As a result, we do not have a fix planned for this issue and are instead opting to publish this Security Advisory to bring it to the attention of users.\r\n\r\nAs always, we encourage Redis operators and admins to review our recommended security practices, and enforce strong access controls or integration with corporate identity provider solutions whenever possible.",
  "affected": [
    {
      "package": {
        "ecosystem": "DHI",
        "name": "redis",
        "purl": "pkg:dhi/redis"
      },
      "ranges": [
        {
          "type": "SEMVER",
          "events": []
        }
      ],
      "database_specific": {
        "source_ecosystem": "",
        "source_package": "redis"
      }
    }
  ],
  "references": [
    {
      "type": "WEB",
      "url": "https://github.com/redis/redis/security/advisories/GHSA-2r7g-8hpc-rpq9"
    }
  ]
}