{
  "modified": "2025-06-18T00:58:37Z",
  "published": "2025-04-10T05:19:16Z",
  "schema_version": "1.5.0",
  "id": "GHSA-8j36-9622-f5cj",
  "details": "### Impact\r\n\r\nA CRLF injection vulnerability was identified by the ClickHouse security team in August 2023. Although this issue does not compromise the overall security of the ClickHouse open-source project or the ClickHouse Cloud product, it could be leveraged to target **other internal systems** accessible from the ClickHouse server.\r\n\r\n### Details\r\n \r\nA malicious actor, with sufficient privileges, could manipulate the query string and header() argument in [ClickHouse URL table function](https://clickhouse.com/docs/sql-reference/table-functions/url). They could then craft arbitrary HTTP requests to other systems reachable from the ClickHouse server. This includes sending HTTP methods other than the typical GET (used for SELECT) and POST (used for INSERT), enabling broader request manipulation from the ClickHouse server.\r\n\r\n### Patches\r\n\r\nThe [fix](https://github.com/ClickHouse/ClickHouse/pull/53146) was introduced on the 9th of Aug 2023. Any version of ClickHouse prior to 23.7.6.111-stable is affected by this vulnerability.\r\n\r\nThe patch has been included on all currently supported versions of ClickHouse after 23.7.6.111-stable, both in the open-source distribution and ClickHouse Cloud.\r\n\r\n### Workarounds\r\n\r\nIf you do not have the need for url table function, revoke url table function from the user by executing the following query:\r\n\r\n```\r\nREVOKE URL ON *.* FROM {username};\r\n```\r\n\r\n### Credit\r\n\r\nThis issue was first discovered by ClickHouse Security team but was also later reported by members of the ByteDance Security Assurance Team (Schuyler Tay, Teck Siong Lim, Yuli Zhan).\r\n",
  "affected": [
    {
      "package": {
        "ecosystem": "DHI",
        "name": "clickhouse-server",
        "purl": "pkg:dhi/clickhouse-server"
      },
      "ranges": [
        {
          "type": "SEMVER",
          "events": [
            {
              "introduced": "0"
            },
            {
              "fixed": "23.7.6+111"
            }
          ]
        }
      ],
      "database_specific": {
        "source_ecosystem": "clickhouse",
        "source_package": "23.7.6.111"
      }
    }
  ],
  "references": [
    {
      "type": "WEB",
      "url": "https://github.com/ClickHouse/ClickHouse/security/advisories/GHSA-8j36-9622-f5cj"
    }
  ]
}